// Напишите программу, которая выводит случайное трехзначное число и удаляет вторую цифру этого числа.

// 1. Сгенерировать трехзначное число
// 2. Разбить число на цифры
// 3. Составить новое число
// 4. Показать его на экране

Console.WriteLine("Hello, World!");
