// Напишите программу, которая будет принимать на вход два числа 
// и выводить, является ли второе число кратным первому. Если второе число не кратно первому, то программа выводит остаток от деления

// в программу вводится число 1 и число 2
// найти остаток деления ч1 на ч2
// проверить (если остаток не равен 0, то показать)







Console.WriteLine("Hello, World!");
